---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalRoughness
source: html/708bdfa6-94f0-a8ed-6db1-c3b68151a919.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalRoughness Property

"Roughness"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalRoughness { get; }
```